---
kind: type
id: T:Autodesk.Revit.DB.DefaultOpenFromCloudCallback
source: html/6269ec13-f36e-64fd-f173-aa7c358912f9.htm
---
# Autodesk.Revit.DB.DefaultOpenFromCloudCallback

A default callback that may be used to control Revit's behavior when opening a model.

## Syntax (C#)
```csharp
public class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
```